// #Task1:  What is Class? What is the difference between class and Object? What is Instance (экзампляр)
// Класс -это чертеж или общая схема чего либо. Класс схема по которой строится или создается объект. Экземпляр- это объкты, которые создаются по классам.




// #Task2:  What do you know about Field and Property?
// Филд-это переменная, которая является приватом. Параметр это комбинация фильда и метода. 




// #Task3: What is Constructor?
// Конструктор – это метод для инициализации класса, т е дать значения классу.





// #Task4: Method overloading is ……
// Метод перегрузки- это когда у одного класса несколько конструкторов. 





// #Task5: Method overriding is …..
// Переопределения метода нужна для изменения Родительского метода в дочернем. Когда нужно изменить метод. 






// #Task6: What is Inheritance? 
// Наследование – это передача всех переменных, параметров и методов от материнского класса к дочерной.